<?php

namespace App\Enums;

class IranianCity
{
    public static function all(): array
    {
        return [
            'تهران' => 'تهران',
            'مشهد' => 'مشهد',
            'اصفهان' => 'اصفهان',
            'تبریز' => 'تبریز',
            'شیراز' => 'شیراز',
            'قم' => 'قم',
            'اهواز' => 'اهواز',
            'کرج' => 'کرج',
            'قزوین' => 'قزوین',
            'رشت' => 'رشت',
            'بندرعباس' => 'بندرعباس',
            'یزد' => 'یزد',
            'همدان' => 'همدان',
            'ارومیه' => 'ارومیه',
            'کرمانشاه' => 'کرمانشاه',
            'گرگان' => 'گرگان',
            'آبادان' => 'آبادان',
            'بندرانزلی' => 'بندرانزلی',
            'بابل' => 'بابل',
            'ساری' => 'ساری',
            'خرم‌آباد' => 'خرم‌آباد',
            'زنجان' => 'زنجان',
            'سنندج' => 'سنندج',
            'اراک' => 'اراک',
            'کرمان' => 'کرمان',
            'سمنان' => 'سمنان',
            'نیشابور' => 'نیشابور',
            'اردبیل' => 'اردبیل',
            'بیرجند' => 'بیرجند',
            'بوشهر' => 'بوشهر',
            'چابهار' => 'چابهار',
        ];
    }

    public static function options(): array
    {
        return self::all();
    }
}
